-- Valentina Studio --
-- MySQL dump --
-- ---------------------------------------------------------


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
-- ---------------------------------------------------------


-- CREATE TABLE "department" -----------------------------------
CREATE TABLE `department`( 
	`id` Int( 0 ) AUTO_INCREMENT NOT NULL,
	`name` VarChar( 255 ) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
	`addr` VarChar( 255 ) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
	`parent_id` Int( 0 ) NULL DEFAULT NULL,
	`point_id` Int( 0 ) NULL DEFAULT NULL,
	`sort_id` Int( 0 ) NOT NULL DEFAULT 0,
	`lat` Decimal( 9, 6 ) NULL DEFAULT NULL,
	`lng` Decimal( 9, 6 ) NULL DEFAULT NULL,
	`state_fxo` TinyInt( 0 ) NOT NULL DEFAULT 2,
	`state_radio` TinyInt( 0 ) NOT NULL DEFAULT 2,
	`is_hidden` TinyInt( 0 ) NOT NULL DEFAULT 0,
	PRIMARY KEY ( `id` ) )
CHARACTER SET = utf8mb4
COLLATE = utf8mb4_general_ci
ENGINE = InnoDB
AUTO_INCREMENT = 498;
-- -------------------------------------------------------------


-- CREATE TABLE "department_to_plan" ---------------------------
CREATE TABLE `department_to_plan`( 
	`department_id` Int( 0 ) NOT NULL,
	`plan_id` Int( 0 ) NOT NULL )
CHARACTER SET = utf8mb4
COLLATE = utf8mb4_general_ci
ENGINE = InnoDB;
-- -------------------------------------------------------------


-- CREATE TABLE "file_to_plan" ---------------------------------
CREATE TABLE `file_to_plan`( 
	`file_id` Int( 0 ) NOT NULL,
	`plan_id` Int( 0 ) NOT NULL )
CHARACTER SET = utf8mb4
COLLATE = utf8mb4_general_ci
ENGINE = InnoDB;
-- -------------------------------------------------------------


-- CREATE TABLE "files" ----------------------------------------
CREATE TABLE `files`( 
	`id` Int( 0 ) AUTO_INCREMENT NOT NULL,
	`url` Text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
	`date` DateTime NOT NULL DEFAULT CURRENT_TIMESTAMP,
	`name` VarChar( 255 ) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
	PRIMARY KEY ( `id` ),
	CONSTRAINT `unique_id` UNIQUE( `id` ) )
CHARACTER SET = utf8mb4
COLLATE = utf8mb4_general_ci
ENGINE = InnoDB
AUTO_INCREMENT = 27;
-- -------------------------------------------------------------


-- CREATE TABLE "history" --------------------------------------
CREATE TABLE `history`( 
	`id` Int( 0 ) AUTO_INCREMENT NOT NULL,
	`user_id` Int( 0 ) NOT NULL,
	`plan_id` Int( 0 ) NOT NULL,
	`date` DateTime NOT NULL DEFAULT CURRENT_TIMESTAMP,
	`type` VarChar( 255 ) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
	`value` VarChar( 255 ) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
	PRIMARY KEY ( `id` ),
	CONSTRAINT `unique_id` UNIQUE( `id` ) )
CHARACTER SET = utf8mb4
COLLATE = utf8mb4_general_ci
ENGINE = InnoDB
AUTO_INCREMENT = 124;
-- -------------------------------------------------------------


-- CREATE TABLE "layer" ----------------------------------------
CREATE TABLE `layer`( 
	`id` Int( 0 ) AUTO_INCREMENT NOT NULL,
	`name` VarChar( 255 ) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
	`description` VarChar( 255 ) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL,
	`visible` TinyInt( 0 ) NOT NULL DEFAULT 1,
	`project_id` Int( 0 ) NOT NULL,
	PRIMARY KEY ( `id` ),
	CONSTRAINT `unique_id` UNIQUE( `id` ) )
CHARACTER SET = utf8mb4
COLLATE = utf8mb4_general_ci
ENGINE = InnoDB
AUTO_INCREMENT = 34;
-- -------------------------------------------------------------


-- CREATE TABLE "plan" -----------------------------------------
CREATE TABLE `plan`( 
	`id` Int( 0 ) AUTO_INCREMENT NOT NULL,
	`name` VarChar( 255 ) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
	`content` MediumText CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
	`user_id` Int( 0 ) NOT NULL,
	`create_at` DateTime NOT NULL DEFAULT CURRENT_TIMESTAMP,
	`date_type` VarChar( 255 ) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
	`date_value` Date NULL DEFAULT NULL,
	`status` VarChar( 255 ) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
	`parent_id` Int( 0 ) NULL DEFAULT NULL,
	PRIMARY KEY ( `id` ),
	CONSTRAINT `unique_id` UNIQUE( `id` ) )
CHARACTER SET = utf8mb4
COLLATE = utf8mb4_general_ci
ENGINE = InnoDB
AUTO_INCREMENT = 57;
-- -------------------------------------------------------------


-- CREATE TABLE "point" ----------------------------------------
CREATE TABLE `point`( 
	`id` Int( 0 ) AUTO_INCREMENT NOT NULL,
	`layer_id` Int( 0 ) NULL DEFAULT NULL,
	`type` VarChar( 255 ) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL,
	`lng` Decimal( 9, 6 ) NOT NULL,
	`lat` Decimal( 9, 6 ) NOT NULL,
	`addr` VarChar( 255 ) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
	`name` VarChar( 255 ) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
	`description` VarChar( 255 ) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL,
	`color` VarChar( 255 ) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '#3498db',
	PRIMARY KEY ( `id` ),
	CONSTRAINT `unique_id` UNIQUE( `id` ) )
CHARACTER SET = utf8mb4
COLLATE = utf8mb4_general_ci
ENGINE = InnoDB
AUTO_INCREMENT = 247;
-- -------------------------------------------------------------


-- CREATE TABLE "point_to_plan" --------------------------------
CREATE TABLE `point_to_plan`( 
	`plan_id` Int( 0 ) NOT NULL,
	`point_id` Int( 0 ) NOT NULL )
CHARACTER SET = utf8mb4
COLLATE = utf8mb4_general_ci
ENGINE = InnoDB;
-- -------------------------------------------------------------


-- CREATE TABLE "project" --------------------------------------
CREATE TABLE `project`( 
	`id` Int( 0 ) AUTO_INCREMENT NOT NULL,
	`name` VarChar( 255 ) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
	`user_id` Int( 0 ) NOT NULL,
	`created_at` DateTime NOT NULL DEFAULT CURRENT_TIMESTAMP,
	`access` VarChar( 255 ) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT 'public',
	`center_lat` Decimal( 9, 6 ) NOT NULL,
	`center_lng` Decimal( 9, 6 ) NOT NULL,
	`scheme` VarChar( 255 ) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL,
	`zoom` Int( 0 ) NOT NULL,
	`showLabels` TinyInt( 0 ) NOT NULL,
	`description` VarChar( 255 ) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
	`updated_at` DateTime NOT NULL DEFAULT CURRENT_TIMESTAMP,
	PRIMARY KEY ( `id` ),
	CONSTRAINT `unique_id` UNIQUE( `id` ) )
CHARACTER SET = utf8mb4
COLLATE = utf8mb4_general_ci
ENGINE = InnoDB
AUTO_INCREMENT = 17;
-- -------------------------------------------------------------


-- CREATE TABLE "role" -----------------------------------------
CREATE TABLE `role`( 
	`name` VarChar( 255 ) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
	`user_id` Int( 0 ) NOT NULL )
CHARACTER SET = utf8mb4
COLLATE = utf8mb4_general_ci
ENGINE = InnoDB;
-- -------------------------------------------------------------


-- CREATE TABLE "user" -----------------------------------------
CREATE TABLE `user`( 
	`id` Int( 0 ) AUTO_INCREMENT NOT NULL,
	`username` VarChar( 255 ) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
	`login` VarChar( 255 ) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
	`pwd_hash` VarChar( 255 ) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
	`create_at` DateTime NOT NULL DEFAULT CURRENT_TIMESTAMP,
	`remember_token` VarChar( 255 ) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
	`is_blocked` TinyInt( 0 ) NOT NULL DEFAULT 0,
	PRIMARY KEY ( `id` ),
	CONSTRAINT `login` UNIQUE( `login` ),
	CONSTRAINT `unique_id` UNIQUE( `id` ) )
CHARACTER SET = utf8mb4
COLLATE = utf8mb4_general_ci
ENGINE = InnoDB
AUTO_INCREMENT = 10;
-- -------------------------------------------------------------


-- CREATE TABLE "department_to_zabbix_node" --------------------
CREATE TABLE `department_to_zabbix_node`( 
	`department_id` Int( 0 ) NOT NULL,
	`zabbix_hosts_hostid` Int( 0 ) NOT NULL )
CHARACTER SET = utf8mb4
COLLATE = utf8mb4_general_ci
ENGINE = InnoDB;
-- -------------------------------------------------------------


-- Dump data of "department" -------------------------------
BEGIN;

INSERT INTO `department`(`id`,`name`,`addr`,`parent_id`,`point_id`,`sort_id`,`lat`,`lng`,`state_fxo`,`state_radio`,`is_hidden`) VALUES 
( '55', 'УЧЕБНЫЙ ПУНКТ ФПС ГПС', '291045, 50 лет Образования СССР, 63', '64', NULL, '3', '48.552795', '39.329631', '2', '2', '0' ),
( '59', 'ЦЕНТР ГИДРОМЕТЕОРОЛОГИИ', '91008, г.Луганск, Городок ЛНАУ, 5-б', '180', NULL, '54', '48.566713', '39.230992', '2', '2', '0' ),
( '62', 'СПЕЦИАЛИЗИРОВАННЫЙ ОТРЯД ', '291042, г.Луганск, ул.30-лет Победы, 51б', NULL, NULL, '21', '48.572470', '39.405551', '2', '2', '0' ),
( '64', '1 ПСО (г. Луганск)', '291047, г. Луганск, ул.Фабричная, 25', NULL, NULL, '22', '48.537543', '39.321257', '2', '2', '0' ),
( '66', '5 ПСЧ ', '291011, г. Луганск, ул.Фабричная, 25', NULL, NULL, '29', '48.537543', '39.321257', '2', '2', '0' ),
( '67', 'СПСЧ', '291042, г. Луганск, ул.30-лет Победы, 51 А', NULL, NULL, '30', '48.572207', '39.404078', '2', '2', '0' ),
( '68', '1 ПСЧ (Г. ЛУГАНСК) ', ' (291011, кв.Алексеева, 12)', NULL, NULL, '23', '48.563612', '39.310735', '2', '2', '0' ),
( '69', '2 ПСЧ  (Г. ЛУГАНСК)', ' (291005, г. Луганск, ул. Демина, 1 а)', NULL, NULL, '24', '48.566128', '39.338385', '2', '2', '0' ),
( '70', '3 ПСЧ (Г. ЛУГАНСК) ', '291029, ул.2-я Краснознаменная, 49', NULL, NULL, '25', '48.535817', '39.276747', '2', '2', '0' ),
( '71', '4 ПСЧ (Г. ЛУГАНСК)', '291014, г. Луганск, ул. Эстонская, 5', NULL, NULL, '27', '48.601752', '39.295374', '2', '2', '0' ),
( '72', 'ОП 3 ПСЧ (ПО ОХРАНЕ ПОС. ЮБИЛЕЙНЫЙ)', '291493 г.Луганск,пгт.Юбилейный ул.Бондаренко, 1-Б', NULL, NULL, '26', '48.554998', '39.178250', '2', '2', '0' ),
( '73', '6 ПСО (Г. КРАСНОДОН)', '294405, г. Краснодон, пр-т 60 лет СССР, 5', NULL, NULL, '35', '48.309859', '39.719659', '2', '2', '0' ),
( '74', '6 ПСЧ (Г. КРАСНОДОН)', '294405, г. Краснодон, пр-т 60 лет СССР, 5', '73', NULL, '32', '48.309859', '39.719659', '2', '2', '0' ),
( '75', 'ОП (ПО ОХРАНЕ ПГТ КРАСНОДОН)', ' (п.Широкий, ул. Клубная, 29)', '73', NULL, '34', '48.308043', '39.584430', '2', '2', '0' ),
( '76', '41 ПСЧ (Г. СУХОДОЛЬСК)', '294420, г. Суходольск, ул. Шоссейная, 103', '73', NULL, '35', '48.354474', '39.731065', '2', '2', '0' ),
( '77', '42 ПСЧ (Г. МОЛОДОГВАРДЕЙСК) ', '294415, г. Молодогвардейск, ул. Калинина, 15', '73', NULL, '36', '48.348093', '39.647381', '2', '2', '0' ),
( '78', '43 ПСЧ (ПГТ ИЗВАРИНО)', 'пгт Изварино ул. Клубная, 2 б', '73', NULL, '37', '48.288934', '39.893505', '2', '2', '0' ),
( '80', '11 ПСО (Г. СВЕРДЛОВСК) ', '294801, г. Свердловск ул. Октябрьская, 33', NULL, NULL, '40', '48.081140', '39.662946', '2', '2', '0' ),
( '81', '7 ПСЧ (Г. СВЕРДЛОВСК)', 'г. Свердловск ул. Октябрьская, 33', '80', NULL, '34', '48.081140', '39.662946', '2', '2', '0' ),
( '82', '8 ПСЧ (ПГТ ШАХТЁРСКИЙ)', 'пгт Шахтёрский, ул.Пролетарская, 5', '80', NULL, '35', '48.056827', '39.554014', '2', '2', '0' ),
( '83', '9 ПСЧ (Г. ЧЕРВОНОПАРТИЗАНСК) ', 'г. Червонопартизанск, ул.Некрасова, 1 а', '80', NULL, '36', '48.072614', '39.772655', '2', '2', '0' ),
( '84', '10 ПСО (Г. РОВЕНЬКИ) ', '294700, г. Ровеньки, ул. Ленина, 11', NULL, NULL, '39', '48.091341', '39.365500', '2', '2', '0' ),
( '85', '10 ПСЧ (Г. РОВЕНЬКИ)', ' (г. Ровеньки, ул.Ленина, 11)', '84', NULL, '35', '48.091341', '39.365500', '2', '2', '0' ),
( '86', 'ОП  10 ПО ОХРАНЕ Г. РОВЕНЬКИ', '294706, г. Ровеньки, ул. Есенина, 3', '84', NULL, '36', '48.063263', '39.324110', '2', '2', '0' ),
( '87', '44 ПСЧ (ПГТ ЯСЕНОВСКИЙ)', ' (г. Ровеньки, пгт Ясеновский, пер. Тюкова, 14)', '84', NULL, '37', '48.158822', '39.214473', '2', '2', '0' ),
( '88', '45 ПСЧ (ПГТ ДЗЕРЖИНСКИЙ)', ' (г. Ровеньки, пгт Дзержинский, ул. Волкова, 63)', '84', NULL, '38', '48.047440', '39.439374', '2', '2', '0' ),
( '89', '3 ПСО (Г. АНТРАЦИТ)', '94613, г. Антрацит, ул.Заводская, 1', NULL, NULL, '32', '48.121016', '39.085550', '2', '2', '0' ),
( '90', 'ОП (ПО ОХРАНЕ ПГТ  ДУБОВСКИЙ)', 'пгт Дубовский (294636, г.Антрацит, пгт Дубовский, ул. Гагарина, 17)', '89', NULL, '6', '48.083434', '39.147308', '2', '2', '0' ),
( '91', '11 ПСЧ  (Г. АНТРАЦИТ)', '294613, г. Антрацит, ул. Заводская, 1', '89', NULL, '5', '48.120655', '39.085051', '2', '2', '0' ),
( '92', 'ОП ПО ОХРАНЕ (ПГТ ИВАНОВКА )', 'пгт Ивановка (94643, Антрацитовский р-н, пгт Ивановка, ул. Пушкина, 23)', '89', NULL, '7', '48.236658', '38.935764', '2', '2', '0' ),
( '93', 'ОП ПО ОХРАНЕ (ПГТ КРЕПЕНСКИЙ)', ' (294632, г. Антрацит, ул. Зеленая, 4)', '89', NULL, '8', '48.088754', '39.052883', '2', '2', '0' ),
( '94', '46 ПСЧ (ПГТ ЩЕТОВО)', ' (94620, г. Антрацит, пгт Щетово ул. Базарная, 8)', '89', NULL, '8', '48.170623', '39.121592', '2', '2', '0' ),
( '96', '5 ПСО (Г. КРАСНЫЙ ЛУЧ)', '294513, г. Красный Луч, ул. МОПРа, 2', NULL, NULL, '34', '48.138035', '38.897492', '2', '2', '0' ),
( '97', '12 ПСЧ (Г. КРАСНЫЙ ЛУЧ)', ' (294513, г. Красный Луч, ул. МОПРа, 2)', '96', NULL, '6', '48.138035', '38.897492', '2', '2', '0' ),
( '98', '13 ПСЧ (Г. ПЕТРОВСКОЕ)', 'г. Петровское, ул. Первомайская, 7', '96', NULL, '7', '48.299669', '38.898276', '2', '2', '0' ),
( '99', '14 ПСЧ (Г. ВАХРУШЕВО)', 'Антрацитовский район, пгт Красный Кут, ул.Свердлова, 138', '96', NULL, '8', '48.203779', '38.810526', '2', '2', '0' ),
( '100', '15 ПСЧ (Г. КРАСНЫЙ ЛУЧ)', 'г. Красный Луч, ул. Луганское Шоссе, 52', '96', NULL, '9', '48.164558', '38.923852', '2', '2', '0' ),
( '101', 'ОП (ПО ОХРАНЕ Г. МИУСИНСК)', 'г. Миусинск, ул.Вокзальная, 29', '96', NULL, '5', '48.092798', '38.882140', '2', '2', '0' ),
( '102', 'Краснолучское ГИМС', 'г. Миусинск, ул. Школьная, 1', '384', NULL, '4', '48.092931', '38.869671', '2', '2', '0' ),
( '103', '9 ПСО (Г. ПЕРЕВАЛЬСК)', '294300, г.Перевальск, ул.Мира, 16', NULL, NULL, '38', '48.437670', '38.813104', '2', '2', '0' ),
( '104', '16 ПСЧ (Г. ПЕРЕВАЛЬСК)', 'г.Перевальск, ул.Мира, 16', NULL, NULL, '1', '48.437731', '38.813209', '2', '2', '0' ),
( '105', '17 ПСЧ (Г. АРТЁМОВСК)', ' (г. Артёмовск, ул.Стаханова, 10)', '103', NULL, '2', '48.443575', '38.733860', '2', '2', '0' ),
( '107', '53 ПСЧ (ПГТ ЧЕРНУХИНО)', 'пгт Чернухино, ул.Папанина, 1', '103', NULL, '3', '48.325326', '38.518906', '2', '2', '0' ),
( '108', '2 ПСО (Г. АЛЧЕВСК)', '294201, г.Алчевск, ул.Репина, 69', NULL, NULL, '31', '48.455448', '38.811564', '2', '2', '0' ),
( '109', '18 ПСЧ (Г. АЛЧЕВСК)', ' (294201, г. Алчевск, ул. Репина, 69) ', '108', NULL, '1', '48.455448', '38.811564', '2', '2', '0' ),
( '110', '19 ПСЧ (Г. АЛЧЕВСК)', ' (294201, ул. Ленинградская, 1а) ', '108', NULL, '1', '48.467839', '38.783525', '2', '2', '0' ),
( '113', '20 ПСЧ (Г. КИРОВСК)', '293805, г. Кировск, ул. Неделина, 2', '120', NULL, '6', '48.646305', '38.661818', '2', '2', '0' ),
( '115', '47 ПСЧ (ПГТ ДОНЕЦКИЙ)', ' (293890, пгт Донецкий, ул. Московская, 2)', '120', NULL, '7', '48.693219', '38.676329', '2', '2', '0' ),
( '116', '48 ПСЧ (ПГТ ЧЕРВОНОГВАРДЕЙСКОЕ) ', ' (293892, пгт Червоногвардейское, ул. Депутатская, 3)', '120', NULL, '8', '48.597106', '38.755186', '2', '2', '0' ),
( '117', '21 ПСЧ (Г. БРЯНКА)', '294100, г.Брянка, ул.Дворцовая, 11-а', '120', NULL, '3', '48.506216', '38.658917', '2', '2', '0' ),
( '119', '49 ПСЧ (ПГТ АННЕНКА)', ' (294104, пгт Анненка, ул. Литвинова, 27)', '120', NULL, '9', '48.468859', '38.638397', '2', '2', '0' ),
( '120', '4 ПСО (Г. СТАХАНОВ)', '294013, г. Стаханов, ул. Бурбело, 8', NULL, NULL, '33', '48.550327', '38.631883', '2', '2', '0' ),
( '121', '22 ПСЧ (Г. СТАХАНОВ) ', ' (294013, г.Стаханов, ул.Бурбело,8)', '120', NULL, '10', '48.550327', '38.631883', '2', '2', '0' ),
( '122', '50 ПСЧ (Г. ИРМИНО)', ' (294092, г.Ирмино, ул.Станюкевича,4)', '120', NULL, '11', '48.596844', '38.592993', '2', '2', '0' ),
( '123', '51 ПСЧ (Г. АЛМАЗНАЯ) ', '294095, г. Алмазная, ул.Теплая, 5', '120', NULL, '44', '48.518259', '38.569469', '2', '2', '0' ),
( '124', '8 ПСО (Г. ПЕРВОМАЙСК)', '293200, г. Первомайск, ул. Лейтенанта Правика, 3', NULL, NULL, '37', '48.617666', '38.518850', '2', '2', '0' ),
( '125', '23 ПСЧ (Г. ПЕРВОМАЙСК) ', ' (293200 г. Первомайск, ул. Лейтенанта Правика, 3)', '124', NULL, '3', '48.617666', '38.518850', '2', '2', '0' ),
( '126', '12 ПСО (ПГТ СЛАВЯНОСЕРБСК)', '293701, п. Славяносербск, пер. Пионерский, 2', NULL, NULL, '41', '48.710456', '38.975827', '2', '2', '0' ),
( '127', '24  ПСЧ (ПГТ СЛАВЯНОСЕРБСК)', '293701, пгт Славяносербск, пер.Пионерский, 2', '126', NULL, '4', '48.710456', '38.975827', '2', '2', '0' ),
( '128', '25 ПСЧ (Г. ЗИМОГОРЬЕ) ', ' (г. Зимогорье, ул. Некрасова, 1)', '126', NULL, '5', '48.577724', '38.940036', '2', '2', '0' ),
( '129', 'ОП  (ПО ОХРАНЕ ПГТ РОДАКОВО)', ' (пгт Родаково, ул.Ворошилова, 4 а)', '126', NULL, '6', '48.549840', '39.039775', '2', '2', '0' ),
( '130', 'ОП (ПО ОХРАНЕ ПГТ ФРУНЗЕ)', 'пгт Фрунзе, ул. Энгельса, 3-а', '126', NULL, '8', '48.665604', '38.754970', '2', '2', '0' ),
( '131', 'ОП  (ПО ОХРАНЕ ПГТ ЛОТИКОВО)', ' (пгт Лотиково, ул.Папанина, 2)', '126', NULL, '7', '48.527771', '38.916382', '2', '2', '0' ),
( '132', '7 ПСО (Г. ЛУТУГИНО)', '292000, г. Лутугино, ул.Марии Буцкой, 1', NULL, NULL, '36', '48.405210', '39.197286', '2', '2', '0' ),
( '133', '26 ПСЧ (Г. ЛУТУГИНО)', ' (292000, г.Лутугино, ул.Марии Буцкой, 1)', '132', NULL, '3', '48.405210', '39.197286', '2', '2', '0' ),
( '134', '27 ПСЧ (ПГТ БЕЛОЕ)', ' (292015, пгт Белое, ул.Труда, 1)', '132', NULL, '5', '48.487362', '39.025689', '2', '2', '0' ),
( '135', 'ОП ПО ОХРАНЕ ПГТ БЕЛОРЕЧЕНСКИЙ ', '292016, пгт Белореченский,ул. Пионеров, 9', '132', NULL, '6', '48.450643', '39.093757', '2', '2', '0' ),
( '136', 'ОП ПО ОХРАНЕ ПГТ УСПЕНКА', '292007, пгт Успенка-1, ул.Гагарина, 13', '132', NULL, '4', '48.403864', '39.136385', '2', '2', '0' ),
( '139', 'ЦУ ВГСО', ' (91493, ул. Артема, 4, п. Юбилейный, г. Луганск)', '180', NULL, '56', '48.556011', '39.184102', '2', '2', '0' ),
( '141', 'ВГСЧ №1 Стаханов', ' (94007, г. Стаханов ул. Мичурина, 2)', '139', NULL, '46', '48.563781', '38.641648', '2', '2', '0' ),
( '146', 'ВГСЧ №2 Краснодон', '94400, г. Краснодон, ул. Ленина, 1', '139', NULL, '48', '48.295449', '39.738596', '2', '2', '0' ),
( '150', 'ВГСЧ №3 Красный Луч', '94520, г. Красный Луч, ул. Орджоникидзе, 20', '139', NULL, '50', '48.139054', '38.920619', '2', '2', '0' ),
( '200', 'СОТ ВГСО ЦУ', '91493, г. Луганск, п.Юбилейный ул. Артема, 4', '139', NULL, '0', '48.556011', '39.184102', '2', '2', '0' ),
( '221', '17 ПСО (ПГТ СТАНИЦА ЛУГАНСКАЯ)', '293600, пгт Станица Луганская ул. 5-я Линия, 24', NULL, NULL, '46', '48.655115', '39.502838', '2', '2', '0' ),
( '222', '29 ПСЧ (ПГТ СТАНИЦА  ЛУГАНСКАЯ)', 'пгт Станица Луганская, ул. 5-я Линия, 24', '221', NULL, '3', '48.655115', '39.502838', '2', '2', '0' ),
( '224', '78 ПСЧ Г.СЧАСТЬЕ', '291480, г. Луганск, г. Счастье, ул. Республиканская, 1а', NULL, NULL, '28', '48.735690', '39.242819', '2', '2', '0' ),
( '225', '18 ПСО (ПГТ МАРКОВКА)', '292400, пгт Марковка, переулок Южный , д.7', NULL, NULL, '47', '49.519589', '39.574740', '2', '2', '0' ),
( '226', '65 ПСЧ (Г. СВАТОВО)', '292603, г. Сватово,  пл. Советская, 45', '242', NULL, '5', '49.418414', '38.144508', '2', '2', '0' ),
( '228', '66 ПСЧ (ПГТ НИЖНЯЯ ДУВАНКА)', 'пгт Нижняя Дуванка, ул. Почтовая, 10', '242', NULL, '6', '49.585623', '38.167832', '2', '2', '0' ),
( '229', '54 ПСЧ (ПГТ БЕЛОВОДСК)', '292800, пгт Беловодск, ул. Заречная, 1', '221', NULL, '60', '49.219383', '39.582355', '2', '2', '0' ),
( '230', '58 ПСЧ (ПГТ ТРОИЦКОЕ)', '292100, пгт Троицкое, ул. Комсомольская, 40', '238', NULL, '6', '49.908923', '38.282459', '2', '2', '0' ),
( '231', '57 ПСЧ (ПГТ НОВОАЙДАР)', '293500, пгт Новоайдар, кв. Мира, 36', '232', NULL, '4', '48.966962', '38.992952', '2', '2', '0' ),
( '232', '14 ПСО (Г. СТАРОБЕЛЬСК)', '292700, г. Старобельск, ул. Старотаганрогская, 113', NULL, NULL, '43', '49.257211', '38.910128', '2', '2', '0' ),
( '233', '64 ПСЧ (Г. СТАРОБЕЛЬСК)', 'г. Старобельск, ул. Старотаганрогская, 113', '232', NULL, '5', '49.257211', '38.910128', '2', '2', '0' ),
( '234', '56 ПСЧ (ПГТ МЕЛОВОЕ)', '292500, пгт Меловое, ул. Луначарского, 80', '225', NULL, '51', '49.379535', '40.130200', '2', '2', '0' ),
( '235', '69 ПСЧ (ПГТ БЕЛОКУРАКИНО)', '292200, пгт Белокуракино, ул. Чапаева, 115', '238', NULL, '4', '49.530488', '38.732908', '2', '2', '0' ),
( '237', 'ОП (ПО ОХРАНЕ ПГТ ЛОЗНО-АЛЕКСАНДРОВКА)', '292211, пгт Лозно-Александровка, ул. Вишнёвая, 54', '238', NULL, '5', '49.836506', '38.739421', '2', '2', '0' ),
( '238', '16 ПСО (ПГТ НОВОПСКОВ)', '292303, пгт Новопсков, ул. Школьная, 7', NULL, NULL, '45', '49.534832', '39.112818', '2', '2', '0' ),
( '239', '67 ПСЧ (ПГТ НОВОПСКОВ)', 'пгт Новопсков, ул. Школьная, 7', '238', NULL, '2', '49.534832', '39.112818', '2', '2', '0' ),
( '240', 'ОП (ПО ОХРАНЕ ПГТ БЕЛОЛУЦК)', '292322, пгт Белолуцк, ул. Кольцова, 1', '238', NULL, '3', '49.699250', '39.019909', '2', '2', '0' ),
( '242', '15 ПСО (Г. КРЕМЕННАЯ)', '292900 г. Кременная, ул. Чайковского, 5', NULL, NULL, '44', '49.043760', '38.225292', '2', '2', '0' ),
( '243', '13 ПСО (Г. СЕВЕРОДОНЕЦК)', '293401, г. Северодонецк, ул. Новикова, 1 б', NULL, NULL, '42', '48.932852', '38.493481', '2', '2', '0' ),
( '244', '76 ПСЧ (Г. КРЕМЕННАЯ)', '292900 г. Кременная, Чайковского, 5', '242', NULL, '3', '49.043760', '38.225292', '2', '2', '0' ),
( '245', '62 ПСЧ (Г. РУБЕЖНОЕ)', 'г. Рубежное, ул. Восточная, 5', '243', NULL, '5', '49.020320', '38.390812', '2', '2', '0' ),
( '246', 'ОП ПО ОХРАНЕ ПГТ КРАСНОРЕЧЕНСК', 'пгт Краснореченск, ул. Станкостроителей, 8 а', '242', NULL, '4', '49.219157', '38.191991', '2', '2', '0' ),
( '247', '59 ПСЧ (Г. ЛИСИЧАНСК)', 'г. Лисичанск, ул. Свердлова, 324', '243', NULL, '4', '48.909587', '38.429094', '2', '2', '0' ),
( '250', '63 ПСЧ (Г. СЕВЕРОДОНЕЦК)', 'г. Северодонецк, ул. Новикова, 1-Б', '243', NULL, '8', '48.932852', '38.493481', '2', '2', '0' ),
( '279', 'ОП ПО ОХРАНЕ ПГТ ПЕТРОВКА', ' (293605, пгт Петровка, ул. Буденного д. 4)', '221', NULL, '4', '48.794940', '39.268807', '2', '2', '0' ),
( '326', 'СПТ', ' г. Луганск, ул.Фабричная, 25', NULL, NULL, '20', '48.538040', '39.320937', '2', '2', '0' ),
( '331', '80 ПСЧ(Г. ГОРСКОЕ) ', '293292, г. Горское, ул. Ивана Данько, 3', '124', NULL, '4', '48.741454', '38.500050', '2', '2', '0' ),
( '360', '55 ПСЧ (ПГТ МАРКОВКА)', '292400, пгт Марковка, переулок Южный, 7', '225', NULL, '3', '49.519589', '39.574740', '2', '2', '0' ),
( '384', 'Центр ГИМС', 'индекс 91031, г. Луганск, 50 лет Образования СССР, 63', NULL, NULL, '100', '48.552721', '39.329639', '2', '2', '0' ),
( '496', '30 ПСЧ', ' г. Северодонецк, ул. Промышленная, 35', '243', NULL, '3', '48.939030', '38.447255', '2', '2', '0' ),
( '497', 'Стадион', 'г. Луганск, ул. 2-я Краснознамённая, 14-В', '64', NULL, '4', '48.533543', '39.282061', '2', '2', '0' );
COMMIT;
-- ---------------------------------------------------------


-- Dump data of "department_to_plan" -----------------------
BEGIN;

INSERT INTO `department_to_plan`(`department_id`,`plan_id`) VALUES 
( '222', '25' ),
( '231', '42' ),
( '82', '26' ),
( '83', '26' ),
( '74', '43' ),
( '78', '44' ),
( '127', '45' ),
( '128', '45' ),
( '224', '46' ),
( '62', '47' ),
( '68', '48' ),
( '84', '49' ),
( '81', '49' ),
( '82', '49' ),
( '233', '50' ),
( '233', '52' ),
( '235', '53' ),
( '108', '54' ),
( '109', '54' ),
( '110', '54' ),
( '113', '56' ),
( '124', '56' ),
( '125', '56' ),
( '120', '55' ),
( '117', '55' ),
( '121', '55' );
COMMIT;
-- ---------------------------------------------------------


-- Dump data of "file_to_plan" -----------------------------
BEGIN;

INSERT INTO `file_to_plan`(`file_id`,`plan_id`) VALUES 
( '26', '44' );
COMMIT;
-- ---------------------------------------------------------


-- Dump data of "files" ------------------------------------
BEGIN;

INSERT INTO `files`(`id`,`url`,`date`,`name`) VALUES 
( '26', 'uploaded/planfiles/e0f60468d14b2516642247b979fc8142.xlsx', '2025-12-22 17:08:17', 'Выгрузка абонентов АТС 22.12.2025.xlsx' );
COMMIT;
-- ---------------------------------------------------------


-- Dump data of "history" ----------------------------------
BEGIN;

INSERT INTO `history`(`id`,`user_id`,`plan_id`,`date`,`type`,`value`) VALUES 
( '62', '1', '24', '2025-12-09 20:03:50', 'add', 'План ооздан!' ),
( '63', '1', '25', '2025-12-09 20:59:40', 'add', 'План ооздан!' ),
( '64', '1', '26', '2025-12-09 21:01:13', 'add', 'План ооздан!' ),
( '65', '1', '26', '2025-12-09 22:44:45', 'edit', 'Изменен родительский план' ),
( '66', '1', '25', '2025-12-09 23:00:42', 'changestatus', 'Статус изменен на \'В работе\'' ),
( '67', '1', '25', '2025-12-09 23:00:53', 'changestatus', 'Статус изменен на \'В работе\'' ),
( '68', '1', '25', '2025-12-09 23:01:21', 'changestatus', 'Статус изменен на \'Ожидание\'' ),
( '69', '1', '25', '2025-12-09 23:01:49', 'changestatus', 'Статус изменен на \'В работе\'' ),
( '70', '1', '25', '2025-12-09 23:01:52', 'changestatus', 'Статус изменен на \'Выполнен\'' ),
( '99', '6', '42', '2025-12-17 09:31:36', 'add', 'План создан!' ),
( '100', '1', '26', '2025-12-17 09:58:25', 'edit', 'Изменен тип даты' ),
( '101', '1', '26', '2025-12-17 09:58:25', 'edit', 'Изменена дата дедлайна' ),
( '102', '1', '26', '2025-12-17 09:58:25', 'changestatus', 'Статус изменен на \'Выполнен\'' ),
( '103', '1', '43', '2025-12-19 10:50:55', 'add', 'План создан!' ),
( '104', '1', '43', '2025-12-19 10:51:01', 'changestatus', 'Статус изменен на \'Выполнен\'' ),
( '105', '1', '44', '2025-12-22 17:08:17', 'add', 'План создан!' ),
( '106', '1', '45', '2025-12-23 15:39:52', 'add', 'План создан!' ),
( '107', '5', '45', '2025-12-23 15:41:31', 'changestatus', 'Статус изменен на \'В работе\'' ),
( '108', '1', '45', '2025-12-24 14:16:36', 'changestatus', 'Статус изменен на \'Выполнен\'' ),
( '109', '1', '46', '2025-12-24 14:17:04', 'add', 'План создан!' ),
( '110', '1', '47', '2026-01-16 10:11:31', 'add', 'План создан!' ),
( '111', '1', '48', '2026-01-16 10:11:54', 'add', 'План создан!' ),
( '112', '1', '49', '2026-01-22 17:12:21', 'add', 'План создан!' ),
( '113', '1', '50', '2026-01-30 10:16:30', 'add', 'План создан!' ),
( '114', '1', '51', '2026-01-30 10:19:17', 'add', 'План создан!' ),
( '115', '1', '52', '2026-01-30 10:20:11', 'add', 'План создан!' ),
( '116', '1', '53', '2026-01-30 10:22:07', 'add', 'План создан!' ),
( '117', '7', '54', '2026-02-04 17:53:07', 'add', 'План создан!' ),
( '118', '7', '55', '2026-02-04 17:54:39', 'add', 'План создан!' ),
( '119', '1', '55', '2026-02-06 09:39:50', 'changestatus', 'Статус изменен на \'Выполнен\'' ),
( '120', '7', '55', '2026-02-09 11:00:45', 'edit', 'Изменено описание' ),
( '121', '7', '55', '2026-02-09 11:01:08', 'edit', 'Изменено описание' ),
( '122', '7', '56', '2026-02-09 11:03:16', 'add', 'План создан!' ),
( '123', '7', '55', '2026-02-09 11:04:12', 'edit', 'Изменено описание' );
COMMIT;
-- ---------------------------------------------------------


-- Dump data of "layer" ------------------------------------
BEGIN;

INSERT INTO `layer`(`id`,`name`,`description`,`visible`,`project_id`) VALUES 
( '29', 'zvezda', NULL, '1', '12' ),
( '30', 'фя', NULL, '1', '12' ),
( '31', 'Подразделения', NULL, '1', '15' ),
( '32', 'Мой слой', NULL, '1', '15' );
COMMIT;
-- ---------------------------------------------------------


-- Dump data of "plan" -------------------------------------
BEGIN;

INSERT INTO `plan`(`id`,`name`,`content`,`user_id`,`create_at`,`date_type`,`date_value`,`status`,`parent_id`) VALUES 
( '24', 'Развертывание АТС в подразделениях', '<p>Установка и настройка АТС во всех подразделениях</p>', '1', '2025-12-09 20:03:50', 'year', '2026-12-31', 'inprogress', NULL ),
( '25', 'АТС настройка 29 ПСЧ Станица', '<p>АТС настройка 29 ПСЧ Станица</p>', '1', '2025-12-09 20:59:40', 'exact', '2025-12-09', 'completed', '24' ),
( '26', 'АТС настройка ПСЧ 8 ПСЧ 9', '<p>АТС настройка ПСЧ 8 ПСЧ 9</p>', '1', '2025-12-09 21:01:13', 'exact', '2025-12-17', 'completed', '24' ),
( '42', 'Замена дуплексера', '<p>Замена дуплексера</p>', '6', '2025-12-17 09:31:36', 'month', '2025-12-31', 'pending', NULL ),
( '43', 'АТС настройка 6 ПСЧ Краснодон', '<p>АТС настройка 6 ПСЧ Краснодон</p>', '1', '2025-12-19 10:50:55', 'exact', '2025-12-18', 'completed', '24' ),
( '44', 'АТС настройка 43 ПСЧ Изварино', '<p>АТС настройка 43 ПСЧ Изварино</p>', '1', '2025-12-22 17:08:17', 'exact', '2025-12-22', 'completed', '24' ),
( '45', 'АТС настройка 24 ПСЧ Славяносербск и 25 ПСЧ Зимогорье', '<p>АТС настройка 24 ПСЧ Славяносербск и 25 ПСЧ Зимогорье</p>', '1', '2025-12-23 15:39:52', 'exact', '2025-12-23', 'completed', '24' ),
( '46', 'АТС настройка 78 ПСЧ Счастье', '<p>АТС настройка 78 ПСЧ Счастье</p>', '1', '2025-12-24 14:17:04', 'exact', '2025-12-24', 'completed', '24' ),
( '47', 'АТС настройка Спец отряд', '<p>АТС настройка Спец отряд</p>', '1', '2026-01-16 10:11:31', 'exact', '2026-01-15', 'completed', '24' ),
( '48', 'АТС настройка 1 ПСЧ', '<p>АТС настройка 1 ПСЧ</p>', '1', '2026-01-16 10:11:54', 'exact', '2026-01-14', 'completed', NULL ),
( '49', 'Выезд Свердловск, Ровеньки Шахтерский', '<p>Выезд Свердловск, Ровеньки Шахтерский</p>', '1', '2026-01-22 17:12:21', 'exact', '2026-01-22', 'completed', NULL ),
( '50', 'АТС выезд Старобельск', '<p>АТС выезд Старобельск</p>', '1', '2026-01-30 10:16:30', 'exact', '2026-01-27', 'completed', NULL ),
( '51', 'План работ по подразделениям', '<p>План работ по подразделениям</p>', '1', '2026-01-30 10:19:17', 'without', '0000-00-00', 'inprogress', NULL ),
( '52', 'Работы по ПСЧ 64 Старобельск', '<p>Подключить 5 IP Телефонов</p><p>Протянуть 2 линии</p>', '1', '2026-01-30 10:20:11', 'year', '2026-12-31', 'pending', '51' ),
( '53', 'АТС настройка 69 ПСЧ Белокуракино', '<p>АТС настройка 69 ПСЧ Белокуракино</p>', '1', '2026-01-30 10:22:07', 'exact', '2026-01-27', 'completed', '24' ),
( '54', 'АТС настройка 2 ПСО, 18 ПСЧ, 19 ПСЧ', '<p>АТС настройка 2 ПСО, 18 ПСЧ, 19 ПСЧ</p>', '7', '2026-02-04 17:53:07', 'exact', '2026-02-03', 'completed', '24' ),
( '55', 'АТС настройка 4 ПСО, 22 ПСЧ г. Стаханов, 21 ПСЧ г. Брянка', '<p>22 ПСЧ г. Стаханов нужно разобраться с FXO;</p><p>21 ПСЧ г. Брянка нужно разобраться с FXO.</p>', '7', '2026-02-04 17:54:39', 'exact', '2026-02-05', 'completed', '24' ),
( '56', 'АТС настройка 20 ПСЧ г. Кировск, 8 ПСО 23 ПСЧ г. Первомайск', '<p>АТС настройка 20 ПСЧ г. Кировск, 8 ПСО 23 ПСЧ г. Первомайск</p>', '7', '2026-02-09 11:03:16', 'exact', '2026-02-10', 'inprogress', '24' );
COMMIT;
-- ---------------------------------------------------------


-- Dump data of "point" ------------------------------------
BEGIN;

INSERT INTO `point`(`id`,`layer_id`,`type`,`lng`,`lat`,`addr`,`name`,`description`,`color`) VALUES 
( '93', '29', NULL, '39.719696', '48.897884', '', 'Метка 1', NULL, '#f39c12' ),
( '94', '29', NULL, '40.013580', '49.024487', '', 'Метка 2', NULL, '#2980b9' ),
( '95', '29', NULL, '40.190735', '49.110355', '', 'Метка 3', NULL, '#f39c12' ),
( '96', '29', NULL, '39.950409', '49.060596', '', 'Метка 4', NULL, '#f39c12' ),
( '97', '29', NULL, '39.818573', '48.838093', '', 'Метка 5', NULL, '#f39c12' ),
( '98', '30', NULL, '39.127808', '49.072968', '', 'Метка 1', NULL, '#2ecc71' ),
( '99', '30', NULL, '39.172440', '48.984722', '', 'Метка 2', NULL, '#2ecc71' ),
( '100', '30', NULL, '39.000778', '48.986977', '', 'Метка 3вам апикаике', NULL, '#2ecc71' ),
( '115', NULL, 'planpoint', '39.368820', '48.491543', '', 'cccc', NULL, '#3498db' ),
( '116', '31', NULL, '0.000000', '0.000000', '', 'СПТ', NULL, '#FF0000' ),
( '117', '31', NULL, '39.405551', '48.572470', '', 'СПЕЦИАЛИЗИРОВАННЫЙ ОТРЯД ', NULL, '#FF0000' ),
( '118', '31', NULL, '39.321257', '48.537543', '', '1 ПСО (г. Луганск)', NULL, '#FF0000' ),
( '119', '31', NULL, '39.329631', '48.552795', '', 'УЧЕБНЫЙ ПУНКТ ФПС ГПС', NULL, '#FF0000' ),
( '120', '31', NULL, '39.310735', '48.563612', '', '1 ПСЧ (Г. ЛУГАНСК) ', NULL, '#FF0000' ),
( '121', '31', NULL, '39.338385', '48.566128', '', '2 ПСЧ  (Г. ЛУГАНСК)', NULL, '#FF0000' ),
( '122', '31', NULL, '39.276747', '48.535817', '', '3 ПСЧ (Г. ЛУГАНСК) ', NULL, '#FF0000' ),
( '123', '31', NULL, '39.178250', '48.554998', '', 'ОП 3 ПСЧ (ПО ОХРАНЕ ПОС. ЮБИЛЕЙНЫЙ)', NULL, '#FF0000' ),
( '124', '31', NULL, '39.295374', '48.601752', '', '4 ПСЧ (Г. ЛУГАНСК)', NULL, '#FF0000' ),
( '125', '31', NULL, '39.242819', '48.735690', '', '78 ПСЧ Г.СЧАСТЬЕ', NULL, '#FF0000' ),
( '126', '31', NULL, '39.321257', '48.537543', '', '5 ПСЧ ', NULL, '#FF0000' ),
( '127', '31', NULL, '39.404078', '48.572207', '', 'СПСЧ', NULL, '#FF0000' ),
( '128', '31', NULL, '38.811564', '48.455448', '', '2 ПСО (Г. АЛЧЕВСК)', NULL, '#FF0000' ),
( '129', '31', NULL, '38.811564', '48.455448', '', '18 ПСЧ (Г. АЛЧЕВСК)', NULL, '#FF0000' ),
( '130', '31', NULL, '38.783525', '48.467839', '', '19 ПСЧ (Г. АЛЧЕВСК)', NULL, '#FF0000' ),
( '131', '31', NULL, '39.085550', '48.121016', '', '3 ПСО (Г. АНТРАЦИТ)', NULL, '#FF0000' ),
( '132', '31', NULL, '39.085051', '48.120655', '', '11 ПСЧ  (Г. АНТРАЦИТ)', NULL, '#FF0000' ),
( '133', '31', NULL, '39.147308', '48.083434', '', 'ОП (ПО ОХРАНЕ ПГТ  ДУБОВСКИЙ)', NULL, '#FF0000' ),
( '134', '31', NULL, '38.935764', '48.236658', '', 'ОП ПО ОХРАНЕ (ПГТ ИВАНОВКА )', NULL, '#FF0000' ),
( '135', '31', NULL, '39.052883', '48.088754', '', 'ОП ПО ОХРАНЕ (ПГТ КРЕПЕНСКИЙ)', NULL, '#FF0000' ),
( '136', '31', NULL, '39.121592', '48.170623', '', '46 ПСЧ (ПГТ ЩЕТОВО)', NULL, '#FF0000' ),
( '137', '31', NULL, '38.631883', '48.550327', '', '4 ПСО (Г. СТАХАНОВ)', NULL, '#FF0000' ),
( '138', '31', NULL, '38.658917', '48.506216', '', '21 ПСЧ (Г. БРЯНКА)', NULL, '#FF0000' ),
( '139', '31', NULL, '38.661818', '48.646305', '', '20 ПСЧ (Г. КИРОВСК)', NULL, '#FF0000' ),
( '140', '31', NULL, '0.000000', '0.000000', '', '47 ПСЧ (ПГТ ДОНЕЦКИЙ)', NULL, '#FF0000' ),
( '141', '31', NULL, '0.000000', '0.000000', '', '48 ПСЧ (ПГТ ЧЕРВОНОГВАРДЕЙСКОЕ) ', NULL, '#FF0000' ),
( '142', '31', NULL, '38.638397', '48.468859', '', '49 ПСЧ (ПГТ АННЕНКА)', NULL, '#FF0000' ),
( '143', '31', NULL, '38.631883', '48.550327', '', '22 ПСЧ (Г. СТАХАНОВ) ', NULL, '#FF0000' ),
( '144', '31', NULL, '38.592993', '48.596844', '', '50 ПСЧ (Г. ИРМИНО)', NULL, '#FF0000' ),
( '145', '31', NULL, '38.569469', '48.518259', '', '51 ПСЧ (Г. АЛМАЗНАЯ) ', NULL, '#FF0000' ),
( '146', '31', NULL, '38.897492', '48.138035', '', '5 ПСО (Г. КРАСНЫЙ ЛУЧ)', NULL, '#FF0000' ),
( '147', '31', NULL, '38.882140', '48.092798', '', 'ОП (ПО ОХРАНЕ Г. МИУСИНСК)', NULL, '#FF0000' ),
( '148', '31', NULL, '38.897492', '48.138035', '', '12 ПСЧ (Г. КРАСНЫЙ ЛУЧ)', NULL, '#FF0000' ),
( '149', '31', NULL, '38.898276', '48.299669', '', '13 ПСЧ (Г. ПЕТРОВСКОЕ)', NULL, '#FF0000' ),
( '150', '31', NULL, '38.810526', '48.203779', '', '14 ПСЧ (Г. ВАХРУШЕВО)', NULL, '#FF0000' ),
( '151', '31', NULL, '38.923852', '48.164558', '', '15 ПСЧ (Г. КРАСНЫЙ ЛУЧ)', NULL, '#FF0000' ),
( '152', '31', NULL, '39.719659', '48.309859', '', '6 ПСО (Г. КРАСНОДОН)', NULL, '#FF0000' ),
( '153', '31', NULL, '39.719659', '48.309859', '', '6 ПСЧ (Г. КРАСНОДОН)', NULL, '#FF0000' ),
( '154', '31', NULL, '39.584430', '48.308043', '', 'ОП (ПО ОХРАНЕ ПГТ КРАСНОДОН)', NULL, '#FF0000' ),
( '155', '31', NULL, '39.731065', '48.354474', '', '41 ПСЧ (Г. СУХОДОЛЬСК)', NULL, '#FF0000' ),
( '156', '31', NULL, '39.647381', '48.348093', '', '42 ПСЧ (Г. МОЛОДОГВАРДЕЙСК) ', NULL, '#FF0000' ),
( '157', '31', NULL, '0.000000', '0.000000', '', '43 ПСЧ (ПГТ ИЗВАРИНО)', NULL, '#FF0000' ),
( '158', '31', NULL, '39.197286', '48.405210', '', '7 ПСО (Г. ЛУТУГИНО)', NULL, '#FF0000' ),
( '159', '31', NULL, '39.197286', '48.405210', '', '26 ПСЧ (Г. ЛУТУГИНО)', NULL, '#FF0000' ),
( '160', '31', NULL, '39.136385', '48.403864', '', 'ОП ПО ОХРАНЕ ПГТ УСПЕНКА', NULL, '#FF0000' ),
( '161', '31', NULL, '39.025689', '48.487362', '', '27 ПСЧ (ПГТ БЕЛОЕ)', NULL, '#FF0000' ),
( '162', '31', NULL, '39.093757', '48.450643', '', 'ОП ПО ОХРАНЕ ПГТ БЕЛОРЕЧЕНСКИЙ ', NULL, '#FF0000' ),
( '163', '31', NULL, '38.518850', '48.617666', '', '8 ПСО (Г. ПЕРВОМАЙСК)', NULL, '#FF0000' ),
( '164', '31', NULL, '38.518850', '48.617666', '', '23 ПСЧ (Г. ПЕРВОМАЙСК) ', NULL, '#FF0000' ),
( '165', '31', NULL, '38.500050', '48.741454', '', '80 ПСЧ(Г. ГОРСКОЕ) ', NULL, '#FF0000' ),
( '166', '31', NULL, '0.000000', '0.000000', '', '9 ПСО (Г. ПЕРЕВАЛЬСК)', NULL, '#FF0000' ),
( '167', '31', NULL, '0.000000', '0.000000', '', '16 ПСЧ (Г. ПЕРЕВАЛЬСК)', NULL, '#FF0000' ),
( '168', '31', NULL, '38.733860', '48.443575', '', '17 ПСЧ (Г. АРТЁМОВСК)', NULL, '#FF0000' ),
( '169', '31', NULL, '0.000000', '0.000000', '', '53 ПСЧ (ПГТ ЧЕРНУХИНО)', NULL, '#FF0000' ),
( '170', '31', NULL, '39.365500', '48.091341', '', '10 ПСО (Г. РОВЕНЬКИ) ', NULL, '#FF0000' ),
( '171', '31', NULL, '39.365500', '48.091341', '', '10 ПСЧ (Г. РОВЕНЬКИ)', NULL, '#FF0000' ),
( '172', '31', NULL, '39.324110', '48.063263', '', 'ОП  10 ПО ОХРАНЕ Г. РОВЕНЬКИ', NULL, '#FF0000' ),
( '173', '31', NULL, '39.214473', '48.158822', '', '44 ПСЧ (ПГТ ЯСЕНОВСКИЙ)', NULL, '#FF0000' ),
( '174', '31', NULL, '39.439374', '48.047440', '', '45 ПСЧ (ПГТ ДЗЕРЖИНСКИЙ)', NULL, '#FF0000' ),
( '175', '31', NULL, '39.662946', '48.081140', '', '11 ПСО (Г. СВЕРДЛОВСК) ', NULL, '#FF0000' ),
( '176', '31', NULL, '39.662946', '48.081140', '', '7 ПСЧ (Г. СВЕРДЛОВСК)', NULL, '#FF0000' ),
( '177', '31', NULL, '39.554014', '48.056827', '', '8 ПСЧ (ПГТ ШАХТЁРСКИЙ)', NULL, '#FF0000' ),
( '178', '31', NULL, '39.772655', '48.072614', '', '9 ПСЧ (Г. ЧЕРВОНОПАРТИЗАНСК) ', NULL, '#FF0000' ),
( '179', '31', NULL, '38.975827', '48.710456', '', '12 ПСО (ПГТ СЛАВЯНОСЕРБСК)', NULL, '#FF0000' ),
( '180', '31', NULL, '38.975827', '48.710456', '', '24  ПСЧ (ПГТ СЛАВЯНОСЕРБСК)', NULL, '#FF0000' ),
( '181', '31', NULL, '38.940036', '48.577724', '', '25 ПСЧ (Г. ЗИМОГОРЬЕ) ', NULL, '#FF0000' ),
( '182', '31', NULL, '39.039775', '48.549840', '', 'ОП  (ПО ОХРАНЕ ПГТ РОДАКОВО)', NULL, '#FF0000' ),
( '183', '31', NULL, '38.916382', '48.527771', '', 'ОП  (ПО ОХРАНЕ ПГТ ЛОТИКОВО)', NULL, '#FF0000' ),
( '184', '31', NULL, '38.754970', '48.665604', '', 'ОП (ПО ОХРАНЕ ПГТ ФРУНЗЕ)', NULL, '#FF0000' ),
( '185', '31', NULL, '38.493481', '48.932852', '', '13 ПСО (Г. СЕВЕРОДОНЕЦК)', NULL, '#FF0000' ),
( '186', '31', NULL, '0.000000', '0.000000', '', '30 ПСЧ', NULL, '#FF0000' ),
( '187', '31', NULL, '38.429094', '48.909587', '', '59 ПСЧ (Г. ЛИСИЧАНСК)', NULL, '#FF0000' ),
( '188', '31', NULL, '38.390812', '49.020320', '', '62 ПСЧ (Г. РУБЕЖНОЕ)', NULL, '#FF0000' ),
( '189', '31', NULL, '38.493481', '48.932852', '', '63 ПСЧ (Г. СЕВЕРОДОНЕЦК)', NULL, '#FF0000' ),
( '190', '31', NULL, '38.910128', '49.257211', '', '14 ПСО (Г. СТАРОБЕЛЬСК)', NULL, '#FF0000' ),
( '191', '31', NULL, '38.992952', '48.966962', '', '57 ПСЧ (ПГТ НОВОАЙДАР)', NULL, '#FF0000' ),
( '192', '31', NULL, '38.910128', '49.257211', '', '64 ПСЧ (Г. СТАРОБЕЛЬСК)', NULL, '#FF0000' ),
( '193', '31', NULL, '38.225292', '49.043760', '', '15 ПСО (Г. КРЕМЕННАЯ)', NULL, '#FF0000' ),
( '194', '31', NULL, '38.225292', '49.043760', '', '76 ПСЧ (Г. КРЕМЕННАЯ)', NULL, '#FF0000' ),
( '195', '31', NULL, '38.191991', '49.219157', '', 'ОП ПО ОХРАНЕ ПГТ КРАСНОРЕЧЕНСК', NULL, '#FF0000' ),
( '196', '31', NULL, '38.144508', '49.418414', '', '65 ПСЧ (Г. СВАТОВО)', NULL, '#FF0000' ),
( '197', '31', NULL, '38.167832', '49.585623', '', '66 ПСЧ (ПГТ НИЖНЯЯ ДУВАНКА)', NULL, '#FF0000' ),
( '198', '31', NULL, '39.112818', '49.534832', '', '16 ПСО (ПГТ НОВОПСКОВ)', NULL, '#FF0000' ),
( '199', '31', NULL, '39.112818', '49.534832', '', '67 ПСЧ (ПГТ НОВОПСКОВ)', NULL, '#FF0000' ),
( '200', '31', NULL, '39.019909', '49.699250', '', 'ОП (ПО ОХРАНЕ ПГТ БЕЛОЛУЦК)', NULL, '#FF0000' ),
( '201', '31', NULL, '38.732908', '49.530488', '', '69 ПСЧ (ПГТ БЕЛОКУРАКИНО)', NULL, '#FF0000' ),
( '202', '31', NULL, '0.000000', '0.000000', '', 'ОП (ПО ОХРАНЕ ПГТ ЛОЗНО-АЛЕКСАНДРОВКА)', NULL, '#FF0000' ),
( '203', '31', NULL, '38.282459', '49.908923', '', '58 ПСЧ (ПГТ ТРОИЦКОЕ)', NULL, '#FF0000' ),
( '204', '31', NULL, '39.502838', '48.655115', '', '17 ПСО (ПГТ СТАНИЦА ЛУГАНСКАЯ)', NULL, '#FF0000' ),
( '205', '31', NULL, '39.502838', '48.655115', '', '29 ПСЧ (ПГТ СТАНИЦА  ЛУГАНСКАЯ)', NULL, '#FF0000' ),
( '206', '31', NULL, '39.268807', '48.794940', '', 'ОП ПО ОХРАНЕ ПГТ ПЕТРОВКА', NULL, '#FF0000' ),
( '207', '31', NULL, '39.582355', '49.219383', '', '54 ПСЧ (ПГТ БЕЛОВОДСК)', NULL, '#FF0000' ),
( '208', '31', NULL, '39.574740', '49.519589', '', '18 ПСО (ПГТ МАРКОВКА)', NULL, '#FF0000' ),
( '209', '31', NULL, '39.574740', '49.519589', '', '55 ПСЧ (ПГТ МАРКОВКА)', NULL, '#FF0000' ),
( '210', '31', NULL, '40.130200', '49.379535', '', '56 ПСЧ (ПГТ МЕЛОВОЕ)', NULL, '#FF0000' ),
( '211', '31', NULL, '39.329639', '48.552721', '', 'Центр ГИМС', NULL, '#FF0000' ),
( '212', '31', NULL, '38.869671', '48.092931', '', 'Краснолучское ГИМС', NULL, '#FF0000' ),
( '213', '32', NULL, '39.049530', '48.592051', '', 'Метка 1', NULL, '#3498db' ),
( '214', '32', NULL, '39.292603', '48.633362', '', 'Метка 2', NULL, '#3498db' ),
( '215', '32', NULL, '39.463577', '48.653779', '', 'Метка 3', NULL, '#3498db' ),
( '216', '32', NULL, '39.565887', '48.580696', '', 'Метка 4', NULL, '#3498db' ),
( '217', '32', NULL, '39.541855', '48.515240', '', 'Метка 5', NULL, '#3498db' ),
( '218', '32', NULL, '39.410019', '48.419176', '', 'Метка 6', NULL, '#3498db' ),
( '219', '32', NULL, '39.158020', '48.629732', '', 'Метка 7', NULL, '#3498db' ),
( '220', '32', NULL, '39.182053', '48.487031', '', 'Метка 8', NULL, '#3498db' ),
( '246', NULL, 'planpoint', '39.133325', '48.863771', '', '520 БС', NULL, '#3498db' );
COMMIT;
-- ---------------------------------------------------------


-- Dump data of "point_to_plan" ----------------------------
BEGIN;

INSERT INTO `point_to_plan`(`plan_id`,`point_id`) VALUES 
( '42', '246' );
COMMIT;
-- ---------------------------------------------------------


-- Dump data of "project" ----------------------------------
BEGIN;

INSERT INTO `project`(`id`,`name`,`user_id`,`created_at`,`access`,`center_lat`,`center_lng`,`scheme`,`zoom`,`showLabels`,`description`,`updated_at`) VALUES 
( '12', 'Мой проект', '1', '2025-12-11 17:04:31', 'public', '49.380138', '39.741669', 'scheme', '9', '1', '123', '2025-12-12 22:42:23' ),
( '15', 'Мой новый проект', '1', '2025-12-15 19:43:50', 'protected', '48.560931', '39.245911', 'scheme', '11', '0', '', '2025-12-15 19:43:50' );
COMMIT;
-- ---------------------------------------------------------


-- Dump data of "role" -------------------------------------
BEGIN;

INSERT INTO `role`(`name`,`user_id`) VALUES 
( 'usercontrol', '1' ),
( 'departmentcontrol', '1' ),
( 'usercontrol', '5' ),
( 'departmentcontrol', '5' ),
( 'usercontrol', '6' ),
( 'departmentcontrol', '6' ),
( 'usercontrol', '7' ),
( 'departmentcontrol', '7' ),
( 'usercontrol', '8' ),
( 'departmentcontrol', '8' ),
( 'usercontrol', '9' ),
( 'departmentcontrol', '9' ),
( 'usercontrol', '10' ),
( 'departmentcontrol', '10' ),
( 'usercontrol', '11' ),
( 'departmentcontrol', '11' );
COMMIT;
-- ---------------------------------------------------------


-- Dump data of "user" -------------------------------------
BEGIN;

INSERT INTO `user`(`id`,`username`,`login`,`pwd_hash`,`create_at`,`remember_token`,`is_blocked`) VALUES 
( '1', 'Администратор', 'admin', '$2y$10$unSmb1jXQKbxB4.ywMR65OEGY2HFVix.bqkKJ.L3VvsMB0aWayR7e', '2025-12-07 16:10:49', '44903e66a9a1a3013d6d426d02f15b8c8c87153d890b1c1a3e27ffe24f11f9f8', '0' ),
( '5', 'Галимурза С.А.', 'ГалимурзаСА', '$2y$10$419jLXhHzz6/7u4VCB9kUe4cgns3CuKebaWylgDtyCJkS2Nekvo4C', '2025-12-12 22:21:55', '8f900348b4be3d2df8d47010df1ae64ba7e0dcd3ff9742efe5385454ca96b0d1', '0' ),
( '6', 'Пономарев С.А.', 'ПономаревСА', '$2y$10$WG4rkPxtciUfZjf.nfpFgOw7rv8KwMBo8bTYiiXl7bPj7CwQaYax2', '2025-12-12 22:23:30', '6c36729b9e5775c24c4641725c0707698ae6ef2581060efb0ec885947b2a94d9', '0' ),
( '7', 'Дьяченко С.А.', 'ДьяченкоСА', '$2y$10$/8oOlvQIrzftsB1Nu.AuGexLLYDS62Go.oCUHzz.SbFjdx5oQ5aaK', '2026-01-28 10:17:31', '', '0' ),
( '8', 'Ильинов Ю.С.', 'ИльиновЮС', '$2y$10$zP.ayzInOa3rXUftiT4gyuBMynms9227Vtx78QV5PDKBq39xcP4lO', '2026-01-28 10:18:25', '5bb886fb984dbb521a206413b45a2836f75d357c910fc3c21cf08687a5a65c55', '0' ),
( '9', 'Гундар С.П.', 'ГундарСП', '$2y$10$yXS.XIgZ6zLpcyr5BWx2ZOOElQGMnR9xafEabTypYN57TuJXrQVw6', '2026-02-05 14:55:13', '', '0' ),
( '10', 'Шулика Т.И.', 'ШуликаТИ', '$2y$10$WWS2MqfYcKPIEtHJdFIb2eRyQsGdGk5KI4ZBlrOANZW46N0jjBKXy', '2026-02-09 12:53:54', '', '0' ),
( '11', 'Сосновский М.А.', 'СосновскийМА', '$2y$10$7ZaFUsA3DzU3f2SftsUYIONhJul55RnXXRm9u4q8X5XpOF/pheuZG', '2026-02-09 14:07:04', '', '0' );
COMMIT;
-- ---------------------------------------------------------


-- Dump data of "department_to_zabbix_node" ----------------
BEGIN;

INSERT INTO `department_to_zabbix_node`(`department_id`,`zabbix_hosts_hostid`) VALUES 
( '68', '10658' ),
( '85', '10737' ),
( '91', '10668' ),
( '97', '10674' ),
( '98', '10676' ),
( '232', '10684' ),
( '99', '10712' ),
( '104', '10657' ),
( '225', '10680' ),
( '109', '10685' ),
( '110', '10686' ),
( '69', '10659' ),
( '113', '10689' ),
( '117', '10687' ),
( '121', '10700' ),
( '125', '10699' ),
( '127', '10702' ),
( '128', '10688' ),
( '133', '10671' ),
( '134', '10672' ),
( '222', '10665' ),
( '70', '10660' ),
( '71', '10661' ),
( '76', '10692' ),
( '78', '10714' ),
( '87', '10696' ),
( '94', '10708' ),
( '119', '10701' ),
( '66', '10662' ),
( '229', '10681' ),
( '234', '10679' ),
( '231', '10691' ),
( '247', '10690' ),
( '74', '10663' ),
( '245', '10734' ),
( '250', '10738' ),
( '226', '10697' ),
( '239', '10682' ),
( '235', '10683' ),
( '81', '10664' ),
( '224', '10666' ),
( '82', '10733' ),
( '83', '10713' ),
( '102', '10695' ),
( '101', '10675' ),
( '72', '10677' ),
( '279', '10736' ),
( '135', '10673' ),
( '90', '10669' ),
( '92', '10670' ),
( '93', '10710' ),
( '237', '10741' ),
( '129', '10698' ),
( '130', '10703' ),
( '67', '10739' ),
( '62', '10678' ),
( '55', '10667' ),
( '68', '10731' ),
( '85', '10715' ),
( '109', '10744' ),
( '110', '10743' ),
( '69', '10651' ),
( '117', '10746' ),
( '121', '10745' ),
( '127', '10728' ),
( '128', '10729' ),
( '133', '10721' ),
( '222', '10724' ),
( '70', '10711' ),
( '71', '10716' ),
( '78', '10727' ),
( '231', '10648' ),
( '247', '10719' ),
( '74', '10726' ),
( '245', '10720' ),
( '250', '10650' ),
( '71', '10655' ),
( '247', '10654' ),
( '233', '10694' ),
( '235', '10740' ),
( '81', '10717' ),
( '224', '10730' ),
( '82', '10722' ),
( '83', '10723' ),
( '67', '10718' ),
( '326', '10649' ),
( '62', '10732' ),
( '150', '10705' ),
( '497', '10704' );
COMMIT;
-- ---------------------------------------------------------


-- CREATE INDEX "lnk_department_department_to_plan" ------------
CREATE INDEX `lnk_department_department_to_plan` USING BTREE ON `department_to_plan`( `department_id` );
-- -------------------------------------------------------------


-- CREATE INDEX "lnk_plan_department_to_plan" ------------------
CREATE INDEX `lnk_plan_department_to_plan` USING BTREE ON `department_to_plan`( `plan_id` );
-- -------------------------------------------------------------


-- CREATE INDEX "lnk_files_file_to_plan" -----------------------
CREATE INDEX `lnk_files_file_to_plan` USING BTREE ON `file_to_plan`( `file_id` );
-- -------------------------------------------------------------


-- CREATE INDEX "lnk_plan_file_to_plan" ------------------------
CREATE INDEX `lnk_plan_file_to_plan` USING BTREE ON `file_to_plan`( `plan_id` );
-- -------------------------------------------------------------


-- CREATE INDEX "lnk_plan_history" -----------------------------
CREATE INDEX `lnk_plan_history` USING BTREE ON `history`( `plan_id` );
-- -------------------------------------------------------------


-- CREATE INDEX "lnk_user_history" -----------------------------
CREATE INDEX `lnk_user_history` USING BTREE ON `history`( `user_id` );
-- -------------------------------------------------------------


-- CREATE INDEX "lnk_project_layer" ----------------------------
CREATE INDEX `lnk_project_layer` USING BTREE ON `layer`( `project_id` );
-- -------------------------------------------------------------


-- CREATE INDEX "lnk_user_plan_2" ------------------------------
CREATE INDEX `lnk_user_plan_2` USING BTREE ON `plan`( `user_id` );
-- -------------------------------------------------------------


-- CREATE INDEX "lnk_layer_point" ------------------------------
CREATE INDEX `lnk_layer_point` USING BTREE ON `point`( `layer_id` );
-- -------------------------------------------------------------


-- CREATE INDEX "lnk_plan_point_to_plan" -----------------------
CREATE INDEX `lnk_plan_point_to_plan` USING BTREE ON `point_to_plan`( `plan_id` );
-- -------------------------------------------------------------


-- CREATE INDEX "lnk_point_point_to_plan" ----------------------
CREATE INDEX `lnk_point_point_to_plan` USING BTREE ON `point_to_plan`( `point_id` );
-- -------------------------------------------------------------


-- CREATE INDEX "lnk_user_project" -----------------------------
CREATE INDEX `lnk_user_project` USING BTREE ON `project`( `user_id` );
-- -------------------------------------------------------------


-- CREATE INDEX "lnk_user_role" --------------------------------
CREATE INDEX `lnk_user_role` USING BTREE ON `role`( `user_id` );
-- -------------------------------------------------------------


-- CREATE INDEX "lnk_department_department_to_zabbix_node" -----
CREATE INDEX `lnk_department_department_to_zabbix_node` USING BTREE ON `department_to_zabbix_node`( `department_id` );
-- -------------------------------------------------------------


-- CREATE LINK "lnk_department_department_to_plan" -------------
ALTER TABLE `department_to_plan`
	ADD CONSTRAINT `lnk_department_department_to_plan` FOREIGN KEY ( `department_id` )
	REFERENCES `department`( `id` )
	ON DELETE Cascade
	ON UPDATE Cascade;
-- -------------------------------------------------------------


-- CREATE LINK "lnk_files_file_to_plan" ------------------------
ALTER TABLE `file_to_plan`
	ADD CONSTRAINT `lnk_files_file_to_plan` FOREIGN KEY ( `file_id` )
	REFERENCES `files`( `id` )
	ON DELETE Cascade
	ON UPDATE Cascade;
-- -------------------------------------------------------------


-- CREATE LINK "lnk_layer_point" -------------------------------
ALTER TABLE `point`
	ADD CONSTRAINT `lnk_layer_point` FOREIGN KEY ( `layer_id` )
	REFERENCES `layer`( `id` )
	ON DELETE Cascade
	ON UPDATE Cascade;
-- -------------------------------------------------------------


-- CREATE LINK "lnk_plan_department_to_plan" -------------------
ALTER TABLE `department_to_plan`
	ADD CONSTRAINT `lnk_plan_department_to_plan` FOREIGN KEY ( `plan_id` )
	REFERENCES `plan`( `id` )
	ON DELETE Cascade
	ON UPDATE Cascade;
-- -------------------------------------------------------------


-- CREATE LINK "lnk_plan_file_to_plan" -------------------------
ALTER TABLE `file_to_plan`
	ADD CONSTRAINT `lnk_plan_file_to_plan` FOREIGN KEY ( `plan_id` )
	REFERENCES `plan`( `id` )
	ON DELETE Cascade
	ON UPDATE Cascade;
-- -------------------------------------------------------------


-- CREATE LINK "lnk_plan_history" ------------------------------
ALTER TABLE `history`
	ADD CONSTRAINT `lnk_plan_history` FOREIGN KEY ( `plan_id` )
	REFERENCES `plan`( `id` )
	ON DELETE Cascade
	ON UPDATE Cascade;
-- -------------------------------------------------------------


-- CREATE LINK "lnk_plan_point_to_plan" ------------------------
ALTER TABLE `point_to_plan`
	ADD CONSTRAINT `lnk_plan_point_to_plan` FOREIGN KEY ( `plan_id` )
	REFERENCES `plan`( `id` )
	ON DELETE Cascade
	ON UPDATE Cascade;
-- -------------------------------------------------------------


-- CREATE LINK "lnk_point_point_to_plan_2" ---------------------
ALTER TABLE `point_to_plan`
	ADD CONSTRAINT `lnk_point_point_to_plan_2` FOREIGN KEY ( `point_id` )
	REFERENCES `point`( `id` )
	ON DELETE Cascade
	ON UPDATE Cascade;
-- -------------------------------------------------------------


-- CREATE LINK "lnk_project_layer" -----------------------------
ALTER TABLE `layer`
	ADD CONSTRAINT `lnk_project_layer` FOREIGN KEY ( `project_id` )
	REFERENCES `project`( `id` )
	ON DELETE Cascade
	ON UPDATE Cascade;
-- -------------------------------------------------------------


-- CREATE LINK "lnk_user_history" ------------------------------
ALTER TABLE `history`
	ADD CONSTRAINT `lnk_user_history` FOREIGN KEY ( `user_id` )
	REFERENCES `user`( `id` )
	ON DELETE Cascade
	ON UPDATE Cascade;
-- -------------------------------------------------------------


-- CREATE LINK "lnk_user_plan" ---------------------------------
ALTER TABLE `plan`
	ADD CONSTRAINT `lnk_user_plan` FOREIGN KEY ( `user_id` )
	REFERENCES `user`( `id` )
	ON DELETE Cascade
	ON UPDATE Cascade;
-- -------------------------------------------------------------


-- CREATE LINK "lnk_user_plan_2" -------------------------------
ALTER TABLE `plan`
	ADD CONSTRAINT `lnk_user_plan_2` FOREIGN KEY ( `user_id` )
	REFERENCES `user`( `id` )
	ON DELETE Cascade
	ON UPDATE Cascade;
-- -------------------------------------------------------------


-- CREATE LINK "lnk_user_project" ------------------------------
ALTER TABLE `project`
	ADD CONSTRAINT `lnk_user_project` FOREIGN KEY ( `user_id` )
	REFERENCES `user`( `id` )
	ON DELETE Cascade
	ON UPDATE Cascade;
-- -------------------------------------------------------------


-- CREATE LINK "lnk_user_role" ---------------------------------
ALTER TABLE `role`
	ADD CONSTRAINT `lnk_user_role` FOREIGN KEY ( `user_id` )
	REFERENCES `user`( `id` )
	ON DELETE Cascade
	ON UPDATE Cascade;
-- -------------------------------------------------------------


-- CREATE LINK "lnk_department_department_to_zabbix_node" ------
ALTER TABLE `department_to_zabbix_node`
	ADD CONSTRAINT `lnk_department_department_to_zabbix_node` FOREIGN KEY ( `department_id` )
	REFERENCES `department`( `id` )
	ON DELETE Cascade
	ON UPDATE Cascade;
-- -------------------------------------------------------------


/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
-- ---------------------------------------------------------


